In [1]:
import datetime

In [4]:
today_date = datetime.datetime.today()

In [5]:
today_date

datetime.datetime(2021, 4, 17, 15, 5, 54, 20285)

In [7]:
today_date - datetime.timedelta(2)

datetime.datetime(2021, 4, 15, 15, 5, 54, 20285)

### List Compehension

In [9]:
days = [today_date - datetime.timedelta(x) for x in range(0,15)]

In [10]:
import pandas as pd

In [12]:
df = pd.DataFrame(days)
df.columns=["Day"]

In [13]:
df.head()

                         Day
0 2021-04-17 15:05:54.020285
1 2021-04-16 15:05:54.020285
2 2021-04-15 15:05:54.020285
3 2021-04-14 15:05:54.020285
4 2021-04-13 15:05:54.020285

In [28]:
df['weekday'] = df['Day'].dt.dayofweek
df['weekday']

0     5
1     4
2     3
3     2
4     1
5     0
6     6
7     5
8     4
9     3
10    2
11    1
12    0
13    6
14    5
Name: weekday, dtype: int64

In [29]:
df.head()

                         Day  weekday
0 2021-04-17 15:05:54.020285        5
1 2021-04-16 15:05:54.020285        4
2 2021-04-15 15:05:54.020285        3
3 2021-04-14 15:05:54.020285        2
4 2021-04-13 15:05:54.020285        1

### count of Frequency encoding

In [30]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header = None,index_col=None) 
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [32]:
len(train_set[1].unique())

9

In [33]:
columns = [1,3,5,6,7,8,9,13]

In [36]:
train_set = train_set[columns]

In [37]:
train_set.columns = ['Employement','Degree','Status','Designation','family_job',
                    'Race','Sex','Country']

In [38]:
train_set.head()

,Employement,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [39]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employement : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [42]:
country_map = train_set['Country'].value_counts().to_dict()

In [44]:
train_set['Country'] = train_set['Country'].map(country_map)

In [45]:
train_set.head()

,Employement,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
1. Easy to use
2. Not increasing feature space
#### Disadvantage
1. It will provide same weight if the frequency are sme

### Target Guided ordinal encoding

1. Ordering the labels according to target
2. Replace the labels by the joint probability of being 1 or 0

In [50]:
df = pd.read_csv('D://DS//titanic.csv',usecols=['cabin','survived'])
df.head()

   survived    cabin
0       1.0       B5
1       1.0  C22 C26
2       0.0  C22 C26
3       0.0  C22 C26
4       0.0  C22 C26

In [51]:
df['cabin'].fillna('Missing',inplace=True)

In [52]:
df.head(10)

   survived    cabin
0       1.0       B5
1       1.0  C22 C26
2       0.0  C22 C26
3       0.0  C22 C26
4       0.0  C22 C26
5       1.0      E12
6       1.0       D7
7       0.0      A36
8       1.0     C101
9       0.0  Missing

In [55]:
df['cabin'] = df['cabin'].astype(str).str[0]

In [57]:
df.cabin.unique()

array(['B', 'C', 'E', 'D', 'A', 'M', 'T', 'F', 'G'], dtype=object)

In [60]:
df.groupby(['cabin'])['survived'].mean()

cabin
A    0.500000
B    0.723077
C    0.606383
D    0.695652
E    0.731707
F    0.619048
G    0.600000
M    0.302761
T    0.000000
Name: survived, dtype: float64

In [62]:
df.groupby(['cabin'])['survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'D', 'B', 'E'], dtype='object', name='cabin')

In [63]:
ordinal_labels = df.groupby(['cabin'])['survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'D', 'B', 'E'], dtype='object', name='cabin')

In [66]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'D': 6, 'B': 7, 'E': 8}

In [67]:
df['cabin_ordinal_labels'] = df['cabin'].map(ordinal_labels2)

In [68]:
df.head()

   survived cabin  cabin_ordinal_labels
0       1.0     B                     7
1       1.0     C                     4
2       0.0     C                     4
3       0.0     C                     4
4       0.0     C                     4

### Mean Encoding

In [71]:
mean_ordinal = df.groupby(['cabin'])['survived'].mean().to_dict()

In [72]:
mean_ordinal

{'A': 0.5,
 'B': 0.7230769230769231,
 'C': 0.6063829787234043,
 'D': 0.6956521739130435,
 'E': 0.7317073170731707,
 'F': 0.6190476190476191,
 'G': 0.6,
 'M': 0.3027613412228797,
 'T': 0.0}

In [73]:
df['mean_ordinal_encode'] = df['cabin'].map(mean_ordinal)

In [74]:
df.head()

   survived cabin  cabin_ordinal_labels  mean_ordinal_encode
0       1.0     B                     7             0.723077
1       1.0     C                     4             0.606383
2       0.0     C                     4             0.606383
3       0.0     C                     4             0.606383
4       0.0     C                     4             0.606383